###############################################################
#  Generated by:      Cadence Encounter 14.13-s036_1
#  OS:                Linux x86_64(Host ID rhel-sal-03.ict.kth.se)
#  Generated on:      Tue Dec  1 16:44:30 2015
#  Design:            FIR_Toplevel_5
#  Command:           saveDesign FIR_Toplevel_5.enc
###############################################################
current_design FIR_Toplevel_5
create_clock [get_ports {clk}]  -name clk -period 4.000000 -waveform {0.000000 2.000000}
set_propagated_clock  [get_ports {clk}]
set_clock_gating_check -rise -setup 0  -hold 0  [get_pins {U_delayline/clk_gate_pointer_reg/main_gate/A2}]
set_clock_gating_check -fall -setup 0  -hold 0  [get_pins {U_delayline/clk_gate_pointer_reg/main_gate/A2}]
set_clock_gating_check -rise -setup 0  -hold 0  [get_pins {U_delayline/clk_gate_pointer_reg/main_gate/A1}]
set_clock_gating_check -fall -setup 0  -hold 0  [get_pins {U_delayline/clk_gate_pointer_reg/main_gate/A1}]
set_clock_gating_check -rise -setup 0  -hold 0  [get_pins {u_FIRP/clk_gate_outp_wire_reg/main_gate/A2}]
set_clock_gating_check -fall -setup 0  -hold 0  [get_pins {u_FIRP/clk_gate_outp_wire_reg/main_gate/A2}]
set_clock_gating_check -rise -setup 0  -hold 0  [get_pins {u_FIRP/clk_gate_outp_wire_reg/main_gate/A1}]
set_clock_gating_check -fall -setup 0  -hold 0  [get_pins {u_FIRP/clk_gate_outp_wire_reg/main_gate/A1}]
set_wire_load_mode top
set_false_path  -from [get_ports {rst_n}] 
